tap "buo/cask-upgrade"
tap "d12frosted/emacs-plus"
tap "gbevin/tools"
tap "helix-editor/helix"
tap "kong/kong"
tap "leoafarias/fvm"
tap "microsoft/mssql-release"
tap "modularml/packages"
tap "openresty/brew"
tap "xo/xo"
# C++ Common Libraries
brew "abseil"
# Search tool like grep, but optimized for programmers
brew "ack"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Library to render SVG files using Cairo
brew "librsvg"
# Universal Command-Line Interface for Alibaba Cloud
brew "aliyun-cli"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Download with resuming and segmented downloading
brew "aria2"
# YAML Parser
brew "libyaml"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# New way of working with Protocol Buffers
brew "buf"
# Extract files from Microsoft cabinet files
brew "cabextract"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Key value store for shared configuration and service discovery
brew "etcd"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Nonsense activity generator
brew "genact"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Powerful, lightweight programming language
brew "lua"
# Command-driven, interactive function plotting
brew "gnuplot"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Vendor and platform neutral SDR support library
brew "soapysdr"
# SDK for signal processing blocks to implement software radios
brew "gnuradio"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Ping, but with a graph
brew "gping"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Next generation open source RPC library and framework
brew "grpc"
# Post-modern modal text editor
brew "helix"
# Library for communicating with USB and Bluetooth HID devices
brew "hidapi"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line benchmarking tool
brew "hyperfine"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Simple terminal UI for git commands
brew "lazygit"
# JIT library for the GNU compiler collection
brew "libgccjit"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Menu-driven communications program
brew "minicom"
# GDI+-compatible API on non-Windows operating systems
brew "mono-libgdiplus"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Modern shell for the GitHub era
brew "nushell"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Utility which converts PDF files into HTML and XML formats
brew "pdftohtml"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Draw UML diagrams
brew "plantuml"
# Tool for managing OCI containers and pods
brew "podman"
# Object-relational database system
brew "postgresql@18"
# Modern replacement for ps written in Rust
brew "procs"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Protoc plugin that generates code for gRPC-Go clients
brew "protoc-gen-go-grpc"
# Command-line YAML and XML processor that wraps jq
brew "python-yq"
# QR Code generation
brew "qrencode"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Python library and command-line utility for Shodan
brew "shodan"
# Cross-shell prompt for astronauts
brew "starship"
# Crypto and x509 Swiss-Army-Knife
brew "step"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Feature-rich console based todo list manager
brew "task"
# Shell wrapper for Taskwarrior commands
brew "tasksh"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Markup-based typesetting system
brew "typst"
# Compact tool for building and debugging applications for Flipper Zero
brew "ufbt"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Multi-platform command-line tool to monitor and receive MIDI messages
brew "gbevin/tools/receivemidi"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql18"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools18"
# Brewfile manager for Homebrew.
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# E-books management software
cask "calibre"
# Terminal-based AI coding assistant
cask "claude-code"
cask "font-droid-sans-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask "font-source-han-sans-vf"
cask "font-source-han-serif-vf"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Tools to protect your emails and files
cask "gpg-suite"
# Software-defined radio receiver powered by GNU Radio and Qt
cask "gqrx"
# Desktop automation application
cask "hammerspoon"
# Hex editor focussing on speed
cask "hex-fiend"
# Hex editor for reverse engineers
cask "imhex"
# Menu bar manager
cask "jordanbaird-ice"
# Open-source keystroke visualiser
cask "keycastr"
# File system integration
cask "macfuse"
# Multi-agent programmable modelling environment
cask "netlogo"
# System and utility switches
cask "only-switch"
# Tool for working with messy data (previously Google Refine)
cask "openrefine"
# Command-line shell and scripting language
cask "powershell"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# Environment for statistical computing and graphics
cask "r-app"
# Modified browser that helps in responsive web development
cask "responsively"
# Data science software focusing on R and Python
cask "rstudio"
# A multi-platform GUI application to effortlessly visualize MIDI activity
cask "showmidi"
# Graphical user interface for TeX Live Manager
cask "tex-live-utility"
# Web browser focusing on security
cask "tor-browser"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Virtual machines UI using QEMU
cask "utm"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Terminal emulator
cask "wave"
# Multiplayer code editor
cask "zed"
mas "Actions", id: 1586435171
mas "Actions For Obsidian", id: 1659667937
mas "Apple Configurator", id: 1037126344
mas "BaiduNetdisk", id: 547166701
mas "Barbee", id: 1548711022
mas "Bitwarden", id: 1352778147
mas "Bluetooth Inspector", id: 1509085044
mas "Developer", id: 640199958
mas "Essentials", id: 1588151344
mas "Folder Peek", id: 1615988943
mas "GarageBand", id: 682658836
mas "GeoGebra Calculator Suite", id: 1504416652
mas "Googly Eyes", id: 6743048714
mas "HP", id: 1474276998
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "NCalc", id: 1449106995
mas "NetEaseMusic", id: 944848654
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "Pages", id: 409201541
mas "Photomator", id: 1444636541
mas "Prodrafts", id: 1545810067
mas "QQ音乐", id: 595615424
mas "Remote Desktop", id: 409907375
mas "Scratch 3", id: 1446785996
mas "Shareful", id: 1522267256
mas "Shazam", id: 897118787
mas "Swift Playground", id: 1496833156
mas "Taio", id: 1527036273
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
mas "千牛", id: 6449173707
mas "同花顺", id: 1247341465
mas "抖音", id: 1640407382
mas "网易有道翻译", id: 491854842
mas "腾讯视频", id: 1231336508
cask "prismlauncher"
cask "mcreator"
cask "blockbench"
