aaron-bond.better-comments
actboy168.lua-debug
alefragnani.bookmarks
alefragnani.project-manager
amazonwebservices.aws-toolkit-vscode
anthropic.claude-code
asciidoctor.asciidoctor-vscode
asvetliakov.vscode-neovim
atopile.atopile
blockceptionltd.blockceptionvscodeminecraftbedrockdevelopmentextension
bmalehorn.vscode-fish
chrisjsewell.myst-tml-syntax
christian-kohler.path-intellisense
cl.keil-assistant
codezombiech.gitignore
dakara.transformer
dart-code.dart-code
dart-code.flutter
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
dineug.vuerd-vscode
docker.docker
donjayamanne.githistory
dotjoshjohnson.xml
drblury.protobuf-vsc
eamodio.gitlens
ecmel.vscode-html-css
editorconfig.editorconfig
emilast.logfilehighlighter
esbenp.prettier-vscode
espressif.esp-idf-extension
firefox-devtools.vscode-firefox-debug
foam.foam-vscode
formulahendry.code-runner
foxundermoon.shell-format
fr43nk.seito-openfile
fwcd.kotlin
gabodev.minecraft-plugin-development
github.codespaces
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
grapecity.gc-excelviewer
gruntfuggly.todo-tree
hediet.vscode-drawio
htmlhint.vscode-htmlhint
ideashpprime.hp-prime-language-support
james-yu.latex-workshop
jebbs.plantuml
jeff-hykin.better-cpp-syntax
jnoortheen.nix-ide
johnheikens.intelliskript
johnheikens.skript
julialang.language-julia
kdl-org.kdl
koihik.vscode-lua-format
leanprover.lean4
lextudio.restructuredtext
llvm-vs-code-extensions.lldb-dap
llvm-vs-code-extensions.vscode-clangd
mads-hartmann.bash-ide-vscode
marus25.cortex-debug
mattn.lisp
mcu-debug.debug-tracker-vscode
mcu-debug.memory-view
mcu-debug.peripheral-viewer
mcu-debug.rtos-views
mechatroner.rainbow-csv
microchip.mplab-data-visualizer
microchip.mplab-extensions-core
microchip.mplab-extensions-platforms
mikestead.dotenv
mohsen1.prettify-json
moonbit.moonbit-lang
ms-azuretools.vscode-azure-github-copilot
ms-azuretools.vscode-azure-mcp-server
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-bicep
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.dotnet-maui
ms-dotnettools.vscode-dotnet-runtime
ms-edgedevtools.vscode-edge-devtools
ms-kubernetes-tools.vscode-kubernetes-tools
ms-mssql.data-workspace-vscode
ms-mssql.mssql
ms-mssql.sql-bindings-vscode
ms-mssql.sql-database-projects-vscode
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-powertoys
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azurecli
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.vscode-chat-customizations-evaluations
ms-vscode.vscode-js-profile-flame
ms-vscode.vscode-serial-monitor
ms-vsliveshare.vsliveshare
myriad-dreamin.tinymist
nash.awesome-flutter-snippets
nefrob.vscode-just-syntax
nicollasr.vscode-streamdeck
oaslananka.kicadstudiokit
oderwat.indent-rainbow
pahimar.minecraft-essentials-extension-pack
platformio.platformio-ide
pomdtr.excalidraw-editor
pomdtr.markdown-kroki
powerquery.vscode-powerquery
qcz.text-power-tools
quarto.quarto
quicktype.quicktype
redhat.java
redhat.vscode-extension-bpmn-editor
redhat.vscode-xml
redhat.vscode-yaml
reditorsupport.r
reditorsupport.r-syntax
rogalmic.bash-debug
rust-lang.rust-analyzer
ryanluker.vscode-coverage-gutters
sandcastle.vscode-open
saoudrizwan.claude-dev
shd101wyy.markdown-preview-enhanced
shengchen.vscode-checkstyle
shopify.ruby-lsp
sleistner.vscode-fileutils
streetsidesoftware.code-spell-checker
stylelint.vscode-stylelint
sumneko.lua
swiftlang.swift-vscode
syler.sass-indented
systemticks.c4-dsl-extension
tamasfe.even-better-toml
terrastruct.d2
thenuprojectcontributors.vscode-nushell-lang
timonwong.shellcheck
trond-snekvik.simple-rst
typescriptteam.native-preview
tyriar.sort-lines
unifiedjs.vscode-mdx
usernamehw.errorlens
vadimcn.vscode-lldb
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
vscodevim.vim
vsls-contrib.gistfs
vspacecode.vspacecode
vspacecode.whichkey
vue.volar
wayou.vscode-todo-highlight
xadillax.viml
xaver.clang-format
xshrim.txt-syntax
yzane.markdown-pdf
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
ziglang.vscode-zig
zignd.html-css-class-completion
